In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('jeopardy.csv')
df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [10]:
#Renaming data columns 
df = df.rename(columns = {" Air Date": "Air Date", " Round" : "Round", 
                                                " Category": "Category", " Value": "Value", 
                                                " Question":"Question", " Answer": "Answer"})

In [11]:
df.columns.tolist()

['Show Number', 'Air Date', 'Round', 'Category', 'Value', 'Question', 'Answer']

## Filtering Words

In [12]:
def filter_data(data, words):
    filter = lambda x: all(word.lower() in x.lower() for word in words)
    return data.loc[data['Question'].apply(filter)]

In [14]:
#testing filter function 
filtered = filter_data(df, ['King','England'])
print(filtered['Question'])

4953      Both England's King George V & FDR put their s...
6337      In retaliation for Viking raids, this "Unready...
9191      This king of England beat the odds to trounce ...
11710     This Scotsman, the first Stuart king of Englan...
13454     It's the number that followed the last king of...
                                ...
208295    In 1066 this great-great grandson of Rollo mad...
208742    Dutch-born king who ruled England jointly with...
213870    In 1781 William Herschel discovered Uranus & i...
216021    His nickname was "Bertie", but he used this na...
216789    This kingdom of England grew from 2 settlement...
Name: Question, Length: 152, dtype: object

In [18]:
#Finding average price for value 
df['float_value']=df['Value'].apply(lambda x: float(x[1:].replace(',','')) if x !='None' else 0)

In [19]:
filtered = filter_data(df,['King'])
print(filtered['float_value'].mean())

771.8833850722094